trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cbc.c
// AES CBC - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_c4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt message_len=16 pkcs7-padding",
    .p_plaintext        = "dededededededededededededededede10101010101010101010101010101010",       /**< The 16 padded bytes (0x10) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "620dd9eb230c761d55593923a7bbdb820eb10da808529643edb8cfd3585bd59a",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_c5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=31 pkcs7-padding",
    .p_plaintext        = "dedededededededededededededededededededededededededededededede",
    .p_ciphertext       = "620dd9eb230c761d55593923a7bbdb82dd286d2d7acf39756cfeb0f836cfb0db",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_c5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt message_len=31 pkcs7-padding",
    .p_plaintext        = "dedededededededededededededededededededededededededededededede01",       /**< The padded byte (0x01) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "620dd9eb230c761d55593923a7bbdb82dd286d2d7acf39756cfeb0f836cfb0db",
    .p_key              = "89df4c819f49dbcbcb124304023cf38c",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Test using test vector NIST CAVS 11.1 GFSBox Tests 128 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_gfsb0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt Key Zero",
    .p_plaintext        = "f34481ec3cc627bacd5dc3fb08f273e6",
    .p_ciphertext       = "0336763e966d92595a567cc9ce537f5e",
    .p_key              = "00000000000000000000000000000000",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CBC - Test using test vector NIST CAVS 11.1 GFSBox Tests 128 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_gfsb0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt Key Zero",
    .p_plaintext        = "f34481ec3cc627bacd5dc3fb08f273e6",
    .p_ciphertext       = "0336763e966d92595a567cc9ce537f5e",
    .p_key              = "00000000000000000000000000000000",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CBC - NIST CAVS 11.1 VarKey Tests 128 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_vk0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt VarKey 0",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "0edd33d3c621e546455bd8ba1418bec8",
    .p_key              = "80000000000000000000000000000000",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CBC - NIST CAVS 11.1 VarKey Tests 128 Encrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_vk127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt VarKey 127",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "a1f6258c877d5fcd8964484538bfc92c",
    .p_key              = "ffffffffffffffffffffffffffffffff",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CBC - NIST CAVS 11.1 VarKey Tests 128 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_vk0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt VarKey 0",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "0edd33d3c621e546455bd8ba1418bec8",
    .p_key              = "80000000000000000000000000000000",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CBC - NIST CAVS 11.1 VarKey Tests 128 Decrypt - Count 127
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_vk127) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt VarKey 127",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "a1f6258c877d5fcd8964484538bfc92c",
    .p_key              = "ffffffffffffffffffffffffffffffff",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_16) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=16",
    .p_plaintext        = "45cf12964fc824ab76616ae2f4bf0822",
    .p_ciphertext       = "0f61c4d44c5147c03c195ad7e2cc12b2",
    .p_key              = "1f8e4973953f3fb0bd6b16662e9a3c17",
    .p_iv               = "2fe2b333ceda8f98f4a99b40d2cd34a8"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_32) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=32",
    .p_plaintext        = "068b25c7bfb1f8bdd4cfc908f69dffc5ddc726a197f0e5f720f730393279be91",
    .p_ciphertext       = "c4dc61d9725967a3020104a9738f23868527ce839aab1752fd8bdb95a82c4d00",
    .p_key              = "0700d603a1c514e46b6191ba430a3a0c",
    .p_iv               = "aad1583cd91365e3bb2f0c3430d065bb"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_48) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=48",
    .p_plaintext        = "9b7cee827a26575afdbb7c7a329f887238052e3601a7917456ba61251c214763d5e1847a6ad5d54127a399ab07ee3599",
    .p_ciphertext       = "d5aed6c9622ec451a15db12819952b6752501cf05cdbf8cda34a457726ded97818e1f127a28d72db5652749f0c6afee5",
    .p_key              = "3348aa51e9a45c2dbe33ccc47f96e8de",
    .p_iv               = "19153c673160df2b1d38c28060e59b96"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_64) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=64",
    .p_plaintext        = "9ac19954ce1319b354d3220460f71c1e373f1cd336240881160cfde46ebfed2e791e8d5a1a136ebd1dc469dec00c4187722b841cdabcb22c1be8a14657da200e",
    .p_ciphertext       = "19b9609772c63f338608bf6eb52ca10be65097f89c1e0905c42401fd47791ae2c5440b2d473116ca78bd9ff2fb6015cfd316524eae7dcb95ae738ebeae84a467",
    .p_key              = "b7f3c9576e12dd0db63e8f8fac2b9a39",
    .p_iv               = "c80f095d8bb1a060699f7c19974a1aa0"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 4
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_80) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=80",
    .p_plaintext        = "db397ec22718dbffb9c9d13de0efcd4611bf792be4fce0dc5f25d4f577ed8cdbd4eb9208d593dda3d4653954ab64f05676caa3ce9bfa795b08b67ceebc923fdc89a8c431188e9e482d8553982cf304d1",
    .p_ciphertext       = "10ea27b19e16b93af169c4a88e06e35c99d8b420980b058e34b4b8f132b13766f72728202b089f428fecdb41c79f8aa0d0ef68f5786481cca29e2126f69bc14160f1ae2187878ba5c49cf3961e1b7ee9",
    .p_key              = "b6f9afbfe5a1562bba1368fc72ac9d9c",
    .p_iv               = "3f9d5ebe250ee7ce384b0d00ee849322"
};

