trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cbc.c
// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 5
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_96) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=96",
    .p_plaintext        = "2aad0c2c4306568bad7447460fd3dac054346d26feddbc9abd9110914011b4794be2a9a00a519a51a5b5124014f4ed2735480db21b434e99a911bb0b60fe0253763725b628d5739a5117b7ee3aefafc5b4c1bf446467e7bf5f78f31ff7caf187",
    .p_ciphertext       = "3b8611bfc4973c5cd8e982b073b33184cd26110159172e44988eb5ff5661a1e16fad67258fcbfee55469267a12dc374893b4e3533d36f5634c3095583596f135aa8cd1138dc898bc5651ee35a92ebf89ab6aeb5366653bc60a70e0074fc11efe",
    .p_key              = "bbe7b7ba07124ff1ae7c3416fe8b465e",
    .p_iv               = "7f65b5ee3630bed6b84202d97fb97a1e"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 6
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_112) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=112",
    .p_plaintext        = "807bc4ea684eedcfdcca30180680b0f1ae2814f35f36d053c5aea6595a386c1442770f4d7297d8b91825ee7237241da8925dd594ccf676aecd46ca2068e8d37a3a0ec8a7d5185a201e663b5ff36ae197110188a23503763b8218826d23ced74b31e9f6e2d7fbfa6cb43420c7807a8625",
    .p_ciphertext       = "406af1429a478c3d07e555c5287a60500d37fc39b68e5bbb9bafd6ddb223828561d6171a308d5b1a4551e8a5e7d572918d25c968d3871848d2f16635caa9847f38590b1df58ab5efb985f2c66cfaf86f61b3f9c0afad6c963c49cee9b8bc81a2ddb06c967f325515a4849eec37ce721a",
    .p_key              = "89a553730433f7e6d67d16d373bd5360",
    .p_iv               = "f724558db3433a523f4e51a5bea70497"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 7
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_128) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=128",
    .p_plaintext        = "cb6a787e0dec56f9a165957f81af336ca6b40785d9e94093c6190e5152649f882e874d79ac5e167bd2a74ce5ae088d2ee854f6539e0a94796b1e1bd4c9fcdbc79acbef4d01eeb89776d18af71ae2a4fc47dd66df6c4dbe1d1850e466549a47b636bcc7c2b3a62495b56bb67b6d455f1eebd9bfefecbca6c7f335cfce9b45cb9d",
    .p_ciphertext       = "7b2931f5855f717145e00f152a9f4794359b1ffcb3e55f594e33098b51c23a6c74a06c1d94fded7fd2ae42c7db7acaef5844cb33aeddc6852585ed0020a6699d2cb53809cefd169148ce42292afab063443978306c582c18b9ce0da3d084ce4d3c482cfd8fcf1a85084e89fb88b40a084d5e972466d07666126fb761f84078f2",
    .p_key              = "c491ca31f91708458e29a925ec558d78",
    .p_iv               = "9ef934946e5cd0ae97bd58532cb49381"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 8
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_144) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=144",
    .p_plaintext        = "f82bef3c73a6f7f80db285726d691db6bf55eec25a859d3ba0e0445f26b9bb3b16a3161ed1866e4dd8f2e5f8ecb4e46d74a7a78c20cdfc7bcc9e479ba7a0caba9438238ad0c01651d5d98de37f03ddce6e6b4bd4ab03cf9e8ed818aedfa1cf963b932067b97d776dce1087196e7e913f7448e38244509f0caf36bd8217e15336d35c149fd4e41707893fdb84014f8729",
    .p_ciphertext       = "b09512f3eff9ed0d85890983a73dadbb7c3678d52581be64a8a8fc586f490f2521297a478a0598040ebd0f5509fafb0969f9d9e600eaef33b1b93eed99687b167f89a5065aac439ce46f3b8d22d30865e64e45ef8cd30b6984353a844a11c8cd60dba0e8866b3ee30d24b3fa8a643b328353e06010fa8273c8fd54ef0a2b6930e5520aae5cd5902f9b86a33592ca4365",
    .p_key              = "f6e87d71b0104d6eb06a68dc6a71f498",
    .p_iv               = "1c245f26195b76ebebc2edcac412a2f8"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Encrypt - Count 9
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_encrypt_160) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 128 Encrypt message_len=160",
    .p_plaintext        = "40d930f9a05334d9816fe204999c3f82a03f6a0457a8c475c94553d1d116693adc618049f0a769a2eed6a6cb14c0143ec5cccdbc8dec4ce560cfd206225709326d4de7948e54d603d01b12d7fed752fb23f1aa4494fbb00130e9ded4e77e37c079042d828040c325b1a5efd15fc842e44014ca4374bf38f3c3fc3ee327733b0c8aee1abcd055772f18dc04603f7b2c1ea69ff662361f2be0a171bbdcea1e5d3f",
    .p_ciphertext       = "6be8a12800455a320538853e0cba31bd2d80ea0c85164a4c5c261ae485417d93effe2ebc0d0a0b51d6ea18633d210cf63c0c4ddbc27607f2e81ed9113191ef86d56f3b99be6c415a4150299fb846ce7160b40b63baf1179d19275a2e83698376d28b92548c68e06e6d994e2c1501ed297014e702cdefee2f656447706009614d801de1caaf73f8b7fa56cf1ba94b631933bbe577624380850f117435a0355b2b",
    .p_key              = "2c14413751c31e2730570ba3361c786b",
    .p_iv               = "1dbbeb2f19abb448af849796244a19d7"
};


// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_16) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt message_len=16",
    .p_plaintext        = "940bc76d61e2c49dddd5df7f37fcf105",
    .p_ciphertext       = "f8eb31b31e374e960030cd1cadb0ef0c",
    .p_key              = "6a7082cf8cda13eff48c8158dda206ae",
    .p_iv               = "bd4172934078c2011cb1f31cffaf486e"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 1
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_32) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt message_len=32",
    .p_plaintext        = "360dc1896ce601dfb2a949250067aad96737847a4580ede2654a329b842fe81e",
    .p_ciphertext       = "5d6fed86f0c4fe59a078d6361a142812514b295dc62ff5d608a42ea37614e6a1",
    .p_key              = "625eefa18a4756454e218d8bfed56e36",
    .p_iv               = "73d9d0e27c2ec568fbc11f6a0998d7c8"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 2
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_48) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt message_len=48",
    .p_plaintext        = "a206385945b21f812a9475f47fddbb7fbdda958a8d14c0dbcdaec36e8b28f1f6ececa1ceae4ce17721d162c1d42a66c1",
    .p_ciphertext       = "e29e3114c8000eb484395b256b1b3267894f290d3999819ff35da03e6463c186c4d7ebb964941f1986a2d69572fcaba8",
    .p_key              = "fd6e0b954ae2e3b723d6c9fcae6ab09b",
    .p_iv               = "f08b65c9f4dd950039941da2e8058c4e"
};

// AES CBC - NIST CAVS 11.1 Multiblock Message Tests 128 Decrypt - Count 3
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_64) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 128 Decrypt message_len=64",
    .p_plaintext        = "b968aeb199ad6b3c8e01f26c2edad444538c78bfa36ed68ca76123b8cdce615a01f6112bb80bfc3f17490578fb1f909a52e162637b062db04efee291a1f1af60",
    .p_ciphertext       = "d3f89b71e033070f9d7516a6cb4ea5ef51d6fb63d4f0fea089d0a60e47bbb3c2e10e9ba3b282c7cb79aefe3068ce228377c21a58fe5a0f8883d0dbd3d096beca",
    .p_key              = "7b1ab9144b0239315cd5eec6c75663bd",
    .p_iv               = "0b1e74f45c17ff304d99c059ce5cde09"
};

