trezor/trezor-firmware/core/embed/sdk/nrf52/examples/crypto/nrf_crypto/test_app/test_cases/test_vectors_aes_cbc.c
// AES CBC - NIST CAVS 11.1 Monte Carlo 128 Decrypt
NRF_SECTION_ITEM_REGISTER(test_vector_aes_monte_carlo_data, test_vector_aes_t test_vector_aes_cbc_128_decrypt_monte_carlo) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_128_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC Decrypt Monte Carlo 128",
    .p_plaintext        = "4769317b0562c45949c18b3855f8bf4a",
    .p_ciphertext       = "7c54923b0490a9d4de4ec1ce6790aa4d",
    .p_key              = "287b07c78f8e3e1be7c41b3d96c04e6e",
    .p_iv               = "41b461f9464fd515d25413b4241002b8"
};

#endif // NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CBC_128)

#if NRF_MODULE_ENABLED(NRF_CRYPTO_AES_CBC_192)

// AES CBC - Functional test using test vector NIST CAVS 11.1 CBC KeySbox 192 - Count 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_func_data, test_vector_aes_t test_vector_aes_cbc_192_functional) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 192 Functional",
    .p_plaintext        = "00000000000000000000000000000000",
    .p_ciphertext       = "0956259c9cd5cfd0181cca53380cde06",
    .p_key              = "e9f065d7c13573587f7875357dfbb16c53489f6a4bd0f7cd",
    .p_iv               = "00000000000000000000000000000000"
};

// AES CBC - Custom test vector - Encrypt - Message length 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_192_encrypt_c0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 192 Encrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = "73befbe26caa000bb57574a7d33ad60019b40c7a3ac6562d",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Custom test vector - Decrypt - Message length 0
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_192_decrypt_c0) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_192_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 192 Decrypt message_len=0",
    .p_plaintext        = "",
    .p_ciphertext       = "",
    .p_key              = "73befbe26caa000bb57574a7d33ad60019b40c7a3ac6562d",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_192_encrypt_c3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_192_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 192 Encrypt message_len=1 pkcs7-padding",
    .p_plaintext        = "de",
    .p_ciphertext       = "4bb7de2040dad371b882c161608b50ed",
    .p_key              = "73befbe26caa000bb57574a7d33ad60019b40c7a3ac6562d",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_192_decrypt_c3) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_192_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 192 Decrypt message_len=1 pkcs7-padding",
    .p_plaintext        = "de0f0f0f0f0f0f0f0f0f0f0f0f0f0f0f",                                       /**< The 15 padded bytes (0x0f) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "4bb7de2040dad371b882c161608b50ed",
    .p_key              = "73befbe26caa000bb57574a7d33ad60019b40c7a3ac6562d",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_192_encrypt_c4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_192_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 192 Encrypt message_len=16 pkcs7-padding",
    .p_plaintext        = "dededededededededededededededede",
    .p_ciphertext       = "20410bb5a89451158f6e82fb4ab423e5ae4b22c09442248b12d9d7bc09266ae2",
    .p_key              = "73befbe26caa000bb57574a7d33ad60019b40c7a3ac6562d",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Custom test vector - Decrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_192_decrypt_c4) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_192_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_DECRYPT,
    .p_test_vector_name = "CBC 192 Decrypt message_len=16 pkcs7-padding",
    .p_plaintext        = "dededededededededededededededede10101010101010101010101010101010",       /**< The 16 padded bytes (0x10) will be removed in the actual generated plaintext. */
    .p_ciphertext       = "20410bb5a89451158f6e82fb4ab423e5ae4b22c09442248b12d9d7bc09266ae2",
    .p_key              = "73befbe26caa000bb57574a7d33ad60019b40c7a3ac6562d",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

// AES CBC - Custom test vector - Encrypt - pkcs7-padding
NRF_SECTION_ITEM_REGISTER(test_vector_aes_data, test_vector_aes_t test_vector_aes_cbc_192_encrypt_c5) =
{
    .p_aes_info         = &g_nrf_crypto_aes_cbc_192_pad_pkcs7_info,
    .expected_err_code  = NRF_SUCCESS,
    .expected_result    = EXPECTED_TO_PASS,
    .direction          = NRF_CRYPTO_ENCRYPT,
    .p_test_vector_name = "CBC 192 Encrypt message_len=31 pkcs7-padding",
    .p_plaintext        = "dedededededededededededededededededededededededededededededede",
    .p_ciphertext       = "20410bb5a89451158f6e82fb4ab423e5ca4aaff6411c38eb07d63a0c7117d93f",
    .p_key              = "73befbe26caa000bb57574a7d33ad60019b40c7a3ac6562d",
    .p_iv               = "97ead25a84abd4a55268d1d347faee05"
};

